# DataFrames
We can think of a DataFrame as a bunch of Series objects put together to share the same index.

In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.seed(101) # fix same random variables

In [3]:
# CREATING DATAFRAMES
df = pd.DataFrame(data=np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [4]:
# INDEXING and SELECTION
df['W'] # using column

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [5]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [6]:
df[['W','Z']] # multiple columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [7]:
# CREATING NEW COLUMN, if it doesn't exist else updated
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [8]:
# DELETING A ROW
df.drop('A',axis=0) # by default... but to hold use inplace
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [9]:
# DELETING A COLUMN
df.drop('new',axis=1,inplace=True)

In [10]:
# SELECTING ROWS
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [11]:
df.iloc[2]   # index based even if labelled otherwise

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [12]:
df.loc['B','Y'] # row , column

-0.8480769834036315

In [13]:
df.loc[['A','C'],['W','Y']]

          W         Y
A  2.706850  0.907969
C -2.018168  0.528813

## Conditional Selection

In [14]:
df > 0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [15]:
booldf = df>0

In [16]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

### In whole dataframe will return `NaN` for `False`, but in a sub-set of dataframe or series, will return only `True` values

In [17]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [18]:
df[df['W']>0] # conditional selection - df[series of True, False] to get only True values

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [19]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [20]:
result_df = df[df['W']>0]
result_df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
result_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [22]:
df[df['W']>0]['X'] # single step for above

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [23]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [24]:
# df[(df['W']>0) and (df['Y']>0.5)]
# ERROR:
# The truth value of a Series is ambiguous. 
# Use a.empty, a.bool(), a.item(), a.any() or a.all().
# because logicals can't compare series
# Use paranthesis too
# and &
# or |
df[(df['W']>0) & (df['Y']>0.5)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
E  0.190794  1.978757  2.605967  0.683509

## Reset Index

In [25]:
df.reset_index() # makes new column, and resets index

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

## Set Index

In [26]:
new_index = '7 8 9 10 11'.split()

In [27]:
new_index

['7', '8', '9', '10', '11']

In [28]:
df['new index'] = new_index

In [29]:
df

          W         X         Y         Z new index
A  2.706850  0.628133  0.907969  0.503826         7
B  0.651118 -0.319318 -0.848077  0.605965         8
C -2.018168  0.740122  0.528813 -0.589001         9
D  0.188695 -0.758872 -0.933237  0.955057        10
E  0.190794  1.978757  2.605967  0.683509        11

In [30]:
df.set_index('new index')

                  W         X         Y         Z
new index
7          2.706850  0.628133  0.907969  0.503826
8          0.651118 -0.319318 -0.848077  0.605965
9         -2.018168  0.740122  0.528813 -0.589001
10         0.188695 -0.758872 -0.933237  0.955057
11         0.190794  1.978757  2.605967  0.683509

## Multi-Index and Hierarchy

In [31]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [32]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [33]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [34]:
df.loc['G1'] # from outside index

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [35]:
df.loc['G1'].loc[1]  # go from outside to inside

A    0.302665
B    1.693723
Name: 1, dtype: float64

In [36]:
df.index.names = ['Groups','Num'] # labelling index outside to inside

In [37]:
df

                   A         B
Groups Num
G1     1    0.302665  1.693723
       2   -1.706086 -1.159119
       3   -0.134841  0.390528
G2     1    0.166905  0.184502
       2    0.807706  0.072960
       3    0.638787  0.329646

In [38]:
df.loc['G2'].loc[2]['B'] # outside to inside

0.07295967531703869

In [39]:
#cross-section
df.xs('G1')

            A         B
Num
1    0.302665  1.693723
2   -1.706086 -1.159119
3   -0.134841  0.390528

In [40]:
df.xs(1,level='Num') # the index  where value is 1

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502